Revit 2026 API

# XYZIsWithinLengthLimits Method

---

Validates that the input point is within Revit design limits.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsWithinLengthLimits(
	XYZ point
)
```
```vb
Public Shared Function IsWithinLengthLimits (
	point As XYZ
) As Boolean
```
```cpp
public:
static bool IsWithinLengthLimits(
	XYZ^ point
)
```
```fsharp
static member IsWithinLengthLimits :
        point : XYZ -> bool
```

#### Parameters

point XYZ
    The point to test.

#### Return Value

BooleanTrue if the input point is within Revit design limits, false otherwise.

Used to validate input for geometry construction methods.

#### Reference

XYZ Class

Autodesk.Revit.DB Namespace